In [7]:
import pandas as pd

In [8]:
income = pd.read_csv('./MedianHHIncome.csv')
housePrices = pd.read_csv('./medianHomePrice.csv')

In [9]:
print("data types for income ds")
print(income.dtypes)
income.head()
# yearly dates
# need to convert to year only

data types for income ds
observation_date    object
MedianHHIncome       int64
dtype: object

  observation_date  MedianHHIncome
0           1/1/84           58930
1           1/1/85           60050
2           1/1/86           62280
3           1/1/87           63060
4           1/1/88           63530

In [10]:
income['observation_date'] = pd.to_datetime(income['observation_date']).dt.year

# income

In [11]:
print("data types for house prices ds")
print(housePrices.dtypes)
housePrices.head()
# housePrices.tail()
# quarter-yearly dates --> convert to average per year

data types for house prices ds
observation_date    object
medianPrice          int64
dtype: object

  observation_date  medianPrice
0           1/1/63        17800
1           4/1/63        18000
2           7/1/63        17900
3          10/1/63        18500
4           1/1/64        18500

In [12]:
length = int(len(housePrices)/4)

dates = pd.date_range("19630101", periods=length, freq='Y')

observation_date = [0] * length

for i in range(0, length):
    observation_date[i] = dates[i].year
    
newPrices = pd.DataFrame({'observation_date': observation_date})
newPrices.head()

   observation_date
0              1963
1              1964
2              1965
3              1966
4              1967

In [13]:
avgYearPrice = [0] * length
for i in range(0, length):
    start = i*4
    newPrice = housePrices['medianPrice'][start:start+4].mean()
    avgYearPrice[i] = newPrice

In [14]:
newPrices['avgYearPrice'] = avgYearPrice
newPrices

    observation_date  avgYearPrice
0               1963       18050.0
1               1964       18925.0
2               1965       20125.0
3               1966       21500.0
4               1967       22750.0
..               ...           ...
57              2020      328150.0
58              2021      383000.0
59              2022      432950.0
60              2023      426525.0
61              2024      418950.0

[62 rows x 2 columns]

In [15]:
newPrices = newPrices[newPrices['observation_date'] >= income['observation_date'][0]]
newPrices = newPrices[newPrices['observation_date'] <= income['observation_date'][len(income)-1]]

len(income)
# newPrices
#just need to join
# income.join(newPrices, on='observation_date')
incomeAndPrices = pd.merge(income, newPrices, on="observation_date")

In [16]:
incomeAndPrices.to_csv('incomeAndPrices.csv', index=False)

In [17]:
incomeAndPrices.head()

   observation_date  MedianHHIncome  avgYearPrice
0              1984           58930       79950.0
1              1985           60050       84275.0
2              1986           62280       92025.0
3              1987           63060      104700.0
4              1988           63530      112225.0